CSI API ETABS v1

# cDetailingGetSimilarSlabs Method

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    int GetSimilarSlabs(
    	string SlabName,
    	ref int NumberSimilarSlabs,
    	ref string[] Names
    )

    Function GetSimilarSlabs (
    	SlabName As String,
    	ByRef NumberSimilarSlabs As Integer,
    	ByRef Names As String()
    ) As Integer

    Dim instance As cDetailing
    Dim SlabName As String
    Dim NumberSimilarSlabs As Integer
    Dim Names As String()
    Dim returnValue As Integer

    returnValue = instance.GetSimilarSlabs(SlabName,
    	NumberSimilarSlabs, Names)

    int GetSimilarSlabs(
    	String^ SlabName,
    	int% NumberSimilarSlabs,
    	array<String^>^% Names
    )

    abstract GetSimilarSlabs :
            SlabName : string *
            NumberSimilarSlabs : int byref *
            Names : string[] byref -> int

#### Parameters

SlabName

    Type: SystemString

NumberSimilarSlabs

    Type: SystemInt32

Names

    Type: SystemString

#### Return Value

Type: Int32

See Also

#### Reference

cDetailing Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com